/*
*************************************************************************
*                             包含的头文件
*************************************************************************
*/
#include <stdio.h>
#include "../rtthread/include/rtthread.h"

/*
*************************************************************************
*                              全局变量
*************************************************************************
*/
rt_uint8_t flag1,flag2;

extern rt_list_t  rt_thread_priority_table[RT_THREAD_PRIORITY_MAX];
/*
*************************************************************************
*                      线程控制块 & STACK & 线程声明
*************************************************************************
*/
/* 定义线程控制块 */
struct rt_thread rt_flag1_thread,rt_flag2_thread;

ALIGN(RT_ALIGN_SIZE)
// 定义线程栈
rt_uint8_t rt_flag1_thread_stack[512],rt_flag2_thread_stack[512];

int main() {
    printf("Hello, World!\n");
    return 0;
}
